invocation/core/src/test/resources/test_discover.soap

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:ser="http://sesa.sti2.at/services/">
   <soapenv:Header/>
   <soapenv:Body>
      <ser:discover>
         <categoryList>http://www.test.com/</categoryList>
      </ser:discover>
   </soapenv:Body>
</soapenv:Envelope>